[
    {
      "id": "Booki",
      "title": "Créez la page d'accueil d'une agence de voyage avec HTML & CSS",
      "image": "../../assets/img/projects/LogoBooki.jpg",
      "image2": "../../assets/img/projects/Booki.jpg",
      "technologies": ["HTML", "CSS"],
      "demo": "https://vacarme27.github.io/OC-Booki/",
      "github": "https://github.com/Vacarme27/OC-Booki",
      "description": "Une entreprise fictive appelée Booki, souhaite développer un site internet pour permettre aux usagers de trouver des hébergements et des activités dans la ville de leur choix. Mon objectif était d’intégrer l’interface de la page d’accueil à partir d’une maquette Figma, et ceci avec du HTML et CSS. J’ai utilisé FlexBox pour l’organisation des éléments de la page. C’est une simple page statique, les interactions par exemple avec le champ de recherche n’est pas fonctionnel. La page devait pouvoir s’adapter selon les écrans et ceci grâce au responsive.",
      "competences": ["Implémenter une interface responsive avec HTML et CSS", "Intégrer du contenu conformément à une maquette avec HTML et CSS", "Installer un environnement de développement front-end"]
    },
    { "id": "OhMyFood",
      "title": "Améliorez l'interface d'un site mobile avec des animations CSS",
      "image": "../../assets/img/projects/LogoOhmyfood.jpg",
      "image2": "../../assets/img/projects/Ohmyfood.jpg",
      "technologies": ["HTML", "CSS"],
      "demo": "https://vacarme27.github.io/OC-Ohmyfood/",
      "github": "https://github.com/Vacarme27/OC-Ohmyfood",
      "description": "Une entreprise fictive appelée Ohmyfood! souhaite s’imposer sur le marché de la restauration. Son objectif était de développer un site 100% mobile qui affiche les menus de restaurants gastronomiques. Mon objectif a été d’intégrer les maquettes du site en HTML, CSS des différentes pages : accueil et menu. J’ai eu à développer des animations CSS plus poussées en utilisant les @keyframes.",
      "competences": ["Intégrer une maquette en mobile-first", "Mettre en œuvre des animations CSS", "Versionner son projet avec Git et Github"]
    },{
      "id": "Print-It",
      "title": "Premiers pas sur le langage JavaScript",
      "image": "../../assets/img/projects/LogoPrintit.jpg",
      "image2": "../../assets/img/projects/Printit.jpg",
      "technologies": ["HTML","CSS","JAVASCRIPT"],
      "demo": "https://vacarme27.github.io/OC-Print_it/",
      "github": "https://github.com/Vacarme27/OC-Print_it",
      "description": "Ce projet vise à m'initier au langage JavaScript.En dynamisant le site d'une imprimerie mettant en place un carrousel interactif. Les étapes comprennent la mise à jour du code HTML, l'ajout d'Event Listeners pour les flèches, l'ajout de bullet points au slider, la modification du slide au clic sur les boutons, et enfin la mise en place d'un défilement infini pour le carrousel.",
      "competences": ["Programmer en utilisant les fondamentaux de JavaScript"]
    },
    {
      "id": "Sophie-Bluel",
      "title": "Créez une page web dynamique avec JavaScript",
      "image": "../../assets/img/projects/LogoSophieBluel.jpg",
      "image2": "../../assets/img/projects/SophieBluel.jpg",
      "technologies": ["HTML", "CSS","JAVASCRIPT"],
      "demo": "",
      "github": "https://github.com/Vacarme27/OC-Portfolio_Sophie_Bluel",
      "description": "Dans ce projet fictif, je suis intégré à l'équipe de développement d'un site portfolio pour une architecte d'intérieur (Sophie Bluel). J'ai pour missions de développer la page de présentation des travaux de l'architecte en utilisant le HTML fourni, de créer la page de connexion de l'administrateur du site, et de concevoir une modal pour uploader de nouveaux médias. J'ai accès au Figma du design, au code back-end, au code front-end statique, et à un Kanban pour la gestion des tâches.",
      "competences": ["Gérer les événements utilisateurs avec JavaScript", "Manipuler les éléments du DOM avec JavaScript", "Récupérer les données utilisateurs dans le JavaScript via des formulaires"]
    },
    {
      "id": "Qwenta",
      "title": "Planifiez le développement du site de votre client",
      "image": "../../assets/img/projects/LogoQwenta.jpg",
      "image2": "../../assets/img/projects/Qwenta.jpg",
      "technologies": ["GESTION DE PROJET AGILE", "VEILLE INFORMATIONNELLE"],
      "demo": "https://drive.google.com/drive/folders/1GHCnZ25xaz-r4aO4Z9U9jt8REtNd_35q?usp=drive_link",
      "github": "",
      "description": "Dans ce projet fictif je suis développeur front-end au sein de l'agence webgencia, ce projet est différent des autres, il ne s'agit pas de développer un site mais de mener, préparer et planifier le projet de développement d'un site",
      "competences": ["Présenter une solution technique", "Rédiger les spécifications techniques d'un projet web à partir de besoins fonctionnels", "Découper une fonctionnalités en tâches pour préparer le développement","Mettre en place une méthode de veille technologique","Suivre le déroulement du projet grâce à un outil de gestion de projet"]
    },
    {
      "id": "Kasa",
      "title": "Créez une application web de location immobilière avec React",
      "image": "../../assets/img/projects/LogoKasa.jpg",
      "image2": "../../assets/img/projects/Kasa.jpg",
      "technologies": ["HTML", "CSS","JAVASCRIPT","REACT","REACT-ROUTER","API REST"],
      "demo": "",
      "github": "https://github.com/Vacarme27/OC-Kasa",
      "description": "Kasa est une entreprise fictive qui gère la location de logements entre particuliers depuis une dizaine d’années. Leur site a été codé il y a plus de 10 ans en ASP.NET, et ils souhaitent renouveler leur site en passant à une stack complète en JavaScript avec NodeJS côté Back-end et React côté Front-end. Mon travail a été de développer l’ensemble de l’application avec React.",
      "competences": ["Initialiser une application avec Create React App", "Développer des éléments de l'interface d'un site web grâce à des composants React", "Configurer la navigation entre les pages de l'application avec React Router","Développer une interface web avec Sass"]
    },
    {
      "id": "Nina-Carducci",
      "title": "Optimisez le référencement d'un site de photographe",
      "image": "../../assets/img/projects/LogoNinaCarducci.jpg",
      "image2": "../../assets/img/projects/NinaCarducci.jpg",
      "technologies": ["GOOGLE RICH SNIPPET", "WAVE","AUDIT LIGHTHOUSE"],
      "demo": "https://vacarme27.github.io/OC-NinaCarducci/",
      "github": "https://github.com/Vacarme27/OC-NinaCarducci",
      "description": "Ce projet consiste à optimiser le référencement d'un site web pour une photographe. Je dois effectuer une optimisation globale du site en améliorant ses performances et son SEO. Les missions incluent l'optimisation des images, l'amélioration du code, l'implémentation du référencement local avec Schema.org, l'ajout des metas pour les réseaux sociaux, et la correction des problèmes d'accessibilité. Le projet vise à améliorer la visibilité du site sur les moteurs de recherche et à optimiser les performances.",
      "competences": ["Optimiser la performance d'un site web"]
    },
    {
      "id": "724-events",
      "title": "Débuggez le site d'une agence d'événementiel",
      "image": "../../assets/img/projects/Logo77events.jpg",
      "image2": "../../assets/img/projects/77events.jpg",
      "technologies": ["HTML", "CSS", "JAVASCRIPT","REACT","SASS","JEST"],
      "demo": "",
      "github": "https://github.com/Vacarme27/OC-724events",
      "description": "Ce projet fictif consiste à déboguer et tester un site web pour l'agence événementielle 724events. Le site a été partiellement intégré par un développeur précédent, mais présente des bugs qui entravent son bon fonctionnement. Je dois remplir le cahier de recette en ajoutant des scénarios de test pour vérifier que le site fonctionne correctement.",
      "competences": ["Débugger un site web grâce aux Chrome DevTools", "Rédiger un cahier de recette pour tester un site"]
    },
    {
      "id": "Argent-Bank",
      "title": "Implémentez le front-end d'une application bancaire avec React",
      "image": "../../assets/img/projects/LogoArgentbank.jpg",
      "image2": "../../assets/img/projects/Argentbank.jpg",
      "technologies": ["HTML", "CSS","JAVASCRIPT","REACT","REACT-ROUTER","REDUX","SWAGGER"],
      "demo": "",
      "github": "https://github.com/Vacarme27/OC-ArgentBank",
      "description": "Argent Bank est une banque qui a besoin de mettre en place son application, qui se décompose en deux phases : une phase authentification des utilisateurs, et une phase gestion des transactions. Mon travail a été d’intégrer le site en React de manière complète. J’ai ensuite eu à gérer les appels API, la gestion de jetons JWT, l’utilisation de Redux pour gérer le state de l’ensemble de l’application. J’ai eu également à produire de la documentation d’API avec Swagger.",
      "competences": ["Afficher les données du back end sur l'interface via des appels API", "Configurer des routes API pour la communication client / serveur", "Implémenter la gestion des données avec Redux pour assurer le fonctionnement du front"]
    }    
  ]